<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"ef82f036163b87f42ee577a2c81d3cf21796a96fa81b1fcbed2a36d0c86e8d6f","plan_job_ref":"Job Pull Request Checks #4484 at https://github.com/GSA-TTS/FAC/actions/runs/13920928246","plan_out_hash":"dfc9dcdf94dce8b710282f8bb694eac0141f322b210f44c4756a97336b7aa7c7","plan_hash":"ae5bcb69652d3fa11ec7c4aa17c8384b9cf17eee2308b99a0ef62b441adec24b","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be created
+   resource "cloudfoundry_route" "origin_route_connected" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = "559e0623-9057-45ef-a9ca-e183df56b4e3"
+       host         = "app"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.domain.cloudfoundry_service_instance.external_domain_instance will be updated in-place
!~  resource "cloudfoundry_service_instance" "external_domain_instance" {
+       dashboard_url     = (known after apply)
        id                = "c36480a2-ec78-4e75-b175-d6b53abf2400"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:51:27Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:51:27Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "gsa-fac-fac.gov"
!~      parameters        = (sensitive value)
        tags              = [
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:51:27Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-19T16:22:19Z" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4484](https://github.com/GSA-TTS/FAC/actions/runs/13920928246)